#Importando os dados

In [ ]:
# fecha a conexao com o banco de dados
# conn.close()

In [79]:
# Abre a conexao com o banco de dados
import sqlite3
import pandas as pd
conn = sqlite3.connect( 'database.db' )

In [ ]:
# Consulta dos dados no banco de dados
consulta = """

    SELECT
      fa.loyalty_number,
      fa.year,
      fa.month,
      fa.flights_booked
    FROM
      flight_activity fa
    WHERE
      fa.flights_booked > 2
"""
df_atividade = pd.read_sql_query( consulta, conn )

# confere se deu certo
df_atividade.head()

# Exercicios propostos 1

1. Selecione as colunas: loyalty_number, year, month, flights_booked, total_flights, distance e points_accumulated da tabela
“flight_activity”.
2. Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna distance é maior do que 2000, da tabela
“flight_activity”
3. Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna distance é maior do que 2000 e a coluna
month é igual a 9, da tabela “flight_activity”
4. Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna distance é maior do que 2000 ou a coluna
points_accumulated é menor que 100, da tabela “flight_activity”.
5. Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna loyalty_card é igual a Star da tabela
“flight_loyalty_history”.

In [ ]:
# Importando as bibliotecas

import sqlite3
import pandas as pd

In [ ]:
# Exercicio 01
conn = sqlite3.connect('database.db')

consulta = """

    SELECT
      fa.loyalty_number,
      fa.year,
      fa.month,
      fa.flights_booked,
      fa.total_flights,
      fa.distance,
      fa.points_accumulated
    FROM
      flight_activity fa

"""

df_atividade = pd.read_sql_query( consulta, conn )
df_atividade.head()

In [ ]:
# Exercicio 02
conn = sqlite3.connect('database.db')

consulta = """

  SELECT
     fa.loyalty_number,
     fa.year,
     fa.month,
     fa.flights_booked,
     fa.total_flights,
     fa.distance,
     fa.points_accumulated
  FROM
    flight_activity fa
  WHERE
    distance > 2000

"""

df_atividade = pd.read_sql_query( consulta, conn )
df_atividade.head()

In [ ]:
# Exercicio 03
conn = sqlite3.connect('database.db')

consulta = """

  SELECT
     fa.loyalty_number,
     fa.year,
     fa.month,
     fa.flights_booked,
     fa.total_flights,
     fa.distance,
     fa.points_accumulated
  FROM
    flight_activity fa
  WHERE
    distance > 2000 & month = 9

"""

df_atividade = pd.read_sql_query( consulta, conn )
df_atividade.head()

Empty DataFrame
Columns: [loyalty_number, year, month, flights_booked, total_flights, distance, points_accumulated]
Index: []

In [ ]:
# Exercicio 4

conn = sqlite3.connect('database.db')

consulta = """

  SELECT
     fa.loyalty_number,
     fa.year,
     fa.month,
     fa.flights_booked,
     fa.total_flights,
     fa.distance,
     fa.points_accumulated
  FROM
    flight_activity fa
  WHERE
    distance > 2000 | points_accumulated < 100

"""
df_atividade = pd.read_sql_query( consulta, conn )
df_atividade.head()

In [ ]:
# Exercicio 5

conn = sqlite3.connect('database.db')

consulta1 = """

  SELECT
     fa.loyalty_number,
     fa.year,
     fa.month,
     fa.flights_booked,
     fa.total_flights,
     fa.distance,
     fa.points_accumulated
  FROM
    flight_activity fa


"""
df_atividade1 = pd.read_sql_query( consulta1, conn )
df_atividade1.head()

consulta2 = """

  SELECT
     *
  FROM
    flight_loyalty_history flh
  WHERE
    flh.loyalty_card = "star"

"""

df_atividade2 = pd.read_sql_query( consulta2, conn )
df_atividade2

# Exercicios Propostos 2
1. Selecione as colunas: loyalty_number, country, city, gender e loyalty_card, salary da tabela “flight_loyalty_history”
2. Selecione as mesmas colunas, porém, recupere somente as linhas cuja coluna gender é igual a Female da tabela
“flight_loyalty_history”.
3. Selecione as colunas: loyalty_number, month, year, distance, flights_booked e total_flights da tabela “flight_activity”, e
recupere somente as linhas cuja coluna “flights_booked” é maior do que 10 e a coluna “flights_booked” é menor do que 12,
da tabela “flight_activity”

In [80]:
# Exercicio 01
conn = sqlite3.connect(' database.db ')

consulta = """

  SELECT
    *
  FROM
    flight_activity

"""

df_atividade = pd.read_sql_query( consulta, conn )

DatabaseError: Execution failed on sql '

  SELECT
    *
  FROM
    flight_activity

': no such table: flight_activity